In [11]:
conda install xlrd

Jupyter detected...
2 channel Terms of Service accepted
Retrieving notices: done
Channels:
 - defaults
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /opt/anaconda3

  added / updated specs:
    - xlrd


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    xlrd-2.0.2                 |     pyhd3eb1b0_0          91 KB
    ------------------------------------------------------------
                                           Total:          91 KB

The following NEW packages will be INSTALLED:

  xlrd               pkgs/main/noarch::xlrd-2.0.2-pyhd3eb1b0_0



Downloading and Extracting Packages:

Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [9]:
# Import pandas library for data manipulation and analysis
import pandas as pd

# Read an Excel file into a pandas DataFrame
# - Path specifies the location of the Excel file on the local machine
# - engine="xlrd" specifies the engine to use for reading Excel files
df = pd.read_excel(
    "/Users/rohankondhalkar/Desktop/Pandas/survey.xls",
    engine="xlrd"
)
# Display the DataFrame contents
df

      Name Nationality     Sex  Age Handedness
0    Kathy         USA  Female   23      Right
1    Linda         USA  Female   18      Right
2    Peter         USA    Male   19      Right
3     John         USA    Male   22       Left
4   Fatima   Bangadesh  Female   31       Left
5    Kadir   Bangadesh    Male   25       Left
6   Dhaval       India    Male   35       Left
7   Sudhir       India    Male   31       Left
8   Parvir       India    Male   37      Right
9      Yan       China  Female   52      Right
10    Juan       China  Female   58       Left
11   Liang       China    Male   43       Left

In [10]:
# Create a cross-tabulation table showing the count of individuals
# based on their nationality (rows) and handedness (columns)
pd.crosstab(df.Nationality,df.Handedness)

Handedness   Left  Right
Nationality
Bangadesh       2      0
China           2      1
India           2      1
USA             1      3

In [11]:
# Create a cross-tabulation (contingency table) showing the relationship
# between Handedness and Sex variables in the dataframe
pd.crosstab(df.Handedness, df.Sex)

Sex         Female  Male
Handedness
Left             2     5
Right            3     2

In [12]:
# Create a cross-tabulation (contingency table) showing the count of individuals
# for each combination of Nationality and Sex categories in the dataframe
pd.crosstab(df.Nationality, df.Sex)

Sex          Female  Male
Nationality
Bangadesh         1     1
China             2     1
India             0     3
USA               2     2

In [13]:
# Create a cross-tabulation (contingency table) showing the frequency distribution
# of Age values for each Sex category in the dataframe
pd.crosstab(df.Sex,df.Age)

Age     18  19  22  23  25  31  35  37  43  52  58
Sex
Female   1   0   0   1   0   1   0   0   0   1   1
Male     0   1   1   0   1   1   1   1   1   0   0